Revit 2026 API

# SynchronizeWithCentralOptionsRelinquishBorrowedElements Property

---

Indicates whether Revit should relinquish borrowed elements after synchronizing with central.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool RelinquishBorrowedElements { get; }
```
```vb
Public ReadOnly Property RelinquishBorrowedElements As Boolean
	Get
```
```cpp
public:
property bool RelinquishBorrowedElements {
	bool get ();
}
```
```fsharp
member RelinquishBorrowedElements : bool with get
```

#### Property Value

Boolean

This is a shortcut to access the value stored in CheckedOutElements.

#### Reference

SynchronizeWithCentralOptions Class

Autodesk.Revit.DB Namespace